# Project

Datani yuklash

In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns
from sklearn.preprocessing import LabelEncoder, MinMaxScaler, StandardScaler, RobustScaler

In [2]:
df = pd.read_csv(r'C:\Users\Saidabrorkhon\Downloads\archive (1)\student_admission_record_dirty.csv')

Data bilan tanishish

In [3]:
df.head()

,Name,Age,Gender,Admission Test Score,High School Percentage,City,Admission Status
0,Shehroz,24.0,Female,50.0,68.90,Quetta,Rejected
1,Waqar,21.0,Female,99.0,60.73,Karachi,NaN
2,Bushra,17.0,Male,89.0,NaN,Islamabad,Accepted
3,Aliya,17.0,Male,55.0,85.29,Karachi,Rejected
4,Bilal,20.0,Male,65.0,61.13,Lahore,NaN

In [4]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 157 entries, 0 to 156
Data columns (total 7 columns):
 #   Column                  Non-Null Count  Dtype
---  ------                  --------------  -----
 0   Name                    147 non-null    object
 1   Age                     147 non-null    float64
 2   Gender                  147 non-null    object
 3   Admission Test Score    146 non-null    float64
 4   High School Percentage  146 non-null    float64
 5   City                    147 non-null    object
 6   Admission Status        147 non-null    object
dtypes: float64(3), object(4)
memory usage: 8.7+ KB

In [5]:
df.isnull().sum()

Name                      10
Age                       10
Gender                    10
Admission Test Score      11
High School Percentage    11
City                      10
Admission Status          10
dtype: int64

Data Preprocesing - Missing values

In [3]:
missing_columns = df.columns[df.isnull().sum() > 0]

for col in missing_columns:
  if df[col].dtype == "object":
    df[col] = df[col].fillna(df[col].mode()[0])
  else:
   df[col] = df[col].fillna(df[col].mean())

In [7]:
df.isnull().sum()

Name                      0
Age                       0
Gender                    0
Admission Test Score      0
High School Percentage    0
City                      0
Admission Status          0
dtype: int64

In [8]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 157 entries, 0 to 156
Data columns (total 7 columns):
 #   Column                  Non-Null Count  Dtype
---  ------                  --------------  -----
 0   Name                    157 non-null    object
 1   Age                     157 non-null    float64
 2   Gender                  157 non-null    object
 3   Admission Test Score    157 non-null    float64
 4   High School Percentage  157 non-null    float64
 5   City                    157 non-null    object
 6   Admission Status        157 non-null    object
dtypes: float64(3), object(4)
memory usage: 8.7+ KB

In [9]:
df.head()

,Name,Age,Gender,Admission Test Score,High School Percentage,City,Admission Status
0,Shehroz,24.0,Female,50.0,68.900000,Quetta,Rejected
1,Waqar,21.0,Female,99.0,60.730000,Karachi,Rejected
2,Bushra,17.0,Male,89.0,75.684726,Islamabad,Accepted
3,Aliya,17.0,Male,55.0,85.290000,Karachi,Rejected
4,Bilal,20.0,Male,65.0,61.130000,Lahore,Rejected

Encoding

In [4]:
df_encoded = df.copy()

In [5]:
for col in df_encoded.select_dtypes(include=['object']).columns: # col variablei datatypei object bo'lgan columnlarning har biriga kirib:
  cardinality = df_encoded[col].nunique()                        # Object type bo'lgan columnlarning unique classlari soni --> cardinality
  if cardinality >= 5:                                           # 5 taga teng yoki ko'p bo'lsa
    le = LabelEncoder()                                          # le variablei LabelEncoder()ga assign qilindi
    df_encoded[col] = le.fit_transform(df_encoded[col])          # Eski data yangi labelencoding bo'lgan dataga almashsin         
  else:                                                          # Yoki kam bo'lsa (5tadan) one-hot encodingga almashsin
    df_encoded = pd.get_dummies(df_encoded, columns=[col], dtype=int, drop_first = True)
  df = df_encoded

In [6]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 157 entries, 0 to 156
Data columns (total 7 columns):
 #   Column                     Non-Null Count  Dtype
---  ------                     --------------  -----
 0   Name                       157 non-null    int64
 1   Age                        157 non-null    float64
 2   Admission Test Score       157 non-null    float64
 3   High School Percentage     157 non-null    float64
 4   City                       157 non-null    int64
 5   Gender_Male                157 non-null    int64
 6   Admission Status_Rejected  157 non-null    int64
dtypes: float64(3), int64(4)
memory usage: 8.7 KB

In [7]:
df.head()

,Name,Age,Admission Test Score,High School Percentage,City,Gender_Male,Admission Status_Rejected
0,53,24.0,50.0,68.900000,5,0,1
1,60,21.0,99.0,60.730000,1,0,1
2,11,17.0,89.0,75.684726,0,1,0
3,4,17.0,55.0,85.290000,1,1,1
4,10,20.0,65.0,61.130000,2,1,1

Scaling: Min-max

In [8]:
scaler = MinMaxScaler()
df = scaler.fit_transform(df)

In [9]:
df = pd.DataFrame(df) #Numpy formatdan tablega o'tkazish

In [10]:
df.head()

          0     1         2         3         4    5    6
0  0.841270  1.00  0.354839  0.654772  0.833333  0.0  1.0
1  0.952381  0.88  0.670968  0.586971  0.166667  0.0  1.0
2  0.174603  0.72  0.606452  0.711077  0.000000  1.0  0.0
3  0.063492  0.72  0.387097  0.790788  0.166667  1.0  1.0
4  0.158730  0.84  0.451613  0.590290  0.333333  1.0  1.0

Scaling: Standard

In [ ]:
#scaling column nomlarini ham scale qilib yuborishini oldini olish uchun column nomlari ajratib turiladi
original_columns = df.columns

In [8]:
original_columns

Index(['Name', 'Age', 'Admission Test Score', 'High School Percentage', 'City',
       'Gender_Male', 'Admission Status_Rejected'],
      dtype='object')

In [9]:
len(original_columns)

7

In [ ]:
scaler = StandardScaler()
df = scaler.fit_transform(df)
df = pd.DataFrame(df, columns=original_columns)

In [11]:
df.head()

,Name,Age,Admission Test Score,High School Percentage,City,Gender_Male,Admission Status_Rejected
0,1.094240,0.986563,-1.707425,-0.406488,0.950661,-0.829561,0.908615
1,1.467709,0.301407,1.317567,-0.895971,-1.093911,-0.829561,0.908615
2,-1.146573,-0.612135,0.700222,0.000000,-1.605054,1.205456,-1.100576
3,-1.520042,-0.612135,-1.398752,0.575474,-1.093911,1.205456,0.908615
4,-1.199926,0.073021,-0.781407,-0.872006,-0.582768,1.205456,0.908615

Scaling: Robust

In [6]:
original_columns = df.columns

In [7]:
original_columns

Index(['Name', 'Age', 'Admission Test Score', 'High School Percentage', 'City',
       'Gender_Male', 'Admission Status_Rejected'],
      dtype='object')

In [9]:
scaler = RobustScaler()
df = scaler.fit_transform(df)

In [10]:
df = pd.DataFrame(df, columns=original_columns)

In [11]:
df.head()

,Name,Age,Admission Test Score,High School Percentage,City,Gender_Male,Admission Status_Rejected
0,0.558824,1.00,-1.536530,-0.336377,0.50,0.0,0.0
1,0.764706,0.25,1.185693,-0.741434,-0.50,0.0,0.0
2,-0.676471,-0.75,0.630137,0.000000,-0.75,1.0,-1.0
3,-0.882353,-0.75,-1.258752,0.476216,-0.50,1.0,0.0
4,-0.705882,0.00,-0.703196,-0.721603,-0.25,1.0,0.0